tako0910/py32f0-template/Libraries/CMSIS/Device/PY32F0xx/Include/py32f032x8.h
/********************************* Bit definition for SYSCFG_CFGR3 register *****************************************/
#define SYSCFG_CFGR3_DMA1_MAP_Pos                 (0U)
#define SYSCFG_CFGR3_DMA1_MAP_Msk                 (0x3FUL<<SYSCFG_CFGR3_DMA1_MAP_Pos)               /*!< 0x0000003F */
#define SYSCFG_CFGR3_DMA1_MAP                     SYSCFG_CFGR3_DMA1_MAP_Msk
#define SYSCFG_CFGR3_DMA1_MAP_0                   (0x1UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)                /*!< 0x00000001 */
#define SYSCFG_CFGR3_DMA1_MAP_1                   (0x2UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)                /*!< 0x00000002 */
#define SYSCFG_CFGR3_DMA1_MAP_2                   (0x4UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)                /*!< 0x00000004 */
#define SYSCFG_CFGR3_DMA1_MAP_3                   (0x8UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)                /*!< 0x00000008 */
#define SYSCFG_CFGR3_DMA1_MAP_4                   (0x10UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)               /*!< 0x00000010 */
#define SYSCFG_CFGR3_DMA1_MAP_5                   (0x20UL<<SYSCFG_CFGR3_DMA1_MAP_Pos)               /*!< 0x00000020 */
#define SYSCFG_CFGR3_DMA2_MAP_Pos                 (8U)
#define SYSCFG_CFGR3_DMA2_MAP_Msk                 (0x3FUL<<SYSCFG_CFGR3_DMA2_MAP_Pos)               /*!< 0x00003F00 */
#define SYSCFG_CFGR3_DMA2_MAP                     SYSCFG_CFGR3_DMA2_MAP_Msk
#define SYSCFG_CFGR3_DMA2_MAP_0                   (0x1UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)                /*!< 0x00000100 */
#define SYSCFG_CFGR3_DMA2_MAP_1                   (0x2UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)                /*!< 0x00000200 */
#define SYSCFG_CFGR3_DMA2_MAP_2                   (0x4UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)                /*!< 0x00000400 */
#define SYSCFG_CFGR3_DMA2_MAP_3                   (0x8UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)                /*!< 0x00000800 */
#define SYSCFG_CFGR3_DMA2_MAP_4                   (0x10UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)               /*!< 0x00001000 */
#define SYSCFG_CFGR3_DMA2_MAP_5                   (0x20UL<<SYSCFG_CFGR3_DMA2_MAP_Pos)               /*!< 0x00002000 */
#define SYSCFG_CFGR3_DMA3_MAP_Pos                 (16U)
#define SYSCFG_CFGR3_DMA3_MAP_Msk                 (0x3FUL<<SYSCFG_CFGR3_DMA3_MAP_Pos)               /*!< 0x003F0000 */
#define SYSCFG_CFGR3_DMA3_MAP                     SYSCFG_CFGR3_DMA3_MAP_Msk
#define SYSCFG_CFGR3_DMA3_MAP_0                   (0x1UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)                /*!< 0x00010000 */
#define SYSCFG_CFGR3_DMA3_MAP_1                   (0x2UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)                /*!< 0x00020000 */
#define SYSCFG_CFGR3_DMA3_MAP_2                   (0x4UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)                /*!< 0x00040000 */
#define SYSCFG_CFGR3_DMA3_MAP_3                   (0x8UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)                /*!< 0x00080000 */
#define SYSCFG_CFGR3_DMA3_MAP_4                   (0x10UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)               /*!< 0x00100000 */
#define SYSCFG_CFGR3_DMA3_MAP_5                   (0x20UL<<SYSCFG_CFGR3_DMA3_MAP_Pos)               /*!< 0x00200000 */

/********************************* Bit definition for PA_ENS register *******************************************/
#define SYSCFG_PA_ENS_PA_ENS_Pos                  (0U)
#define SYSCFG_PA_ENS_PA_ENS_Msk                  (0xFFFFUL<<SYSCFG_PA_ENS_PA_ENS_Pos)                 /*!< 0x0000FFFF */
#define SYSCFG_PA_ENS_PA_ENS                      SYSCFG_PA_ENS_PA_ENS_Msk

/********************************* Bit definition for PB_ENS register *******************************************/
#define SYSCFG_PB_ENS_PB_ENS_Pos                  (0U)
#define SYSCFG_PB_ENS_PB_ENS_Msk                  (0xFFFFUL<<SYSCFG_PB_ENS_PB_ENS_Pos)                 /*!< 0x0000FFFF */
#define SYSCFG_PB_ENS_PB_ENS                      SYSCFG_PB_ENS_PB_ENS_Msk

/********************************* Bit definition for PF_ENS register *******************************************/
#define SYSCFG_PF_ENS_PF_ENS_Pos                  (0U)
#define SYSCFG_PF_ENS_PF_ENS_Msk                  (0xFFFFUL<<SYSCFG_PF_ENS_PF_ENS_Pos)                 /*!< 0x0000FFFF */
#define SYSCFG_PF_ENS_PF_ENS                      SYSCFG_PF_ENS_PF_ENS_Msk

/********************************* Bit definition for SYSCFG_IOCFG register *****************************************/
#define SYSCFG_IOCFG_PB_EHS_Pos                   (13U)
#define SYSCFG_IOCFG_PB_EHS_Msk                   (0x7UL<<SYSCFG_IOCFG_PB_EHS_Pos)                  /*!< 0x0000E000 */
#define SYSCFG_IOCFG_PB_EHS                       SYSCFG_IOCFG_PB_EHS_Msk
#define SYSCFG_IOCFG_PB_EHS_0                     (0x1UL<<SYSCFG_IOCFG_PB_EHS_Pos)                  /*!< 0x00002000 */
#define SYSCFG_IOCFG_PB_EHS_1                     (0x2UL<<SYSCFG_IOCFG_PB_EHS_Pos)                  /*!< 0x00004000 */
#define SYSCFG_IOCFG_PB_EHS_2                     (0x4UL<<SYSCFG_IOCFG_PB_EHS_Pos)                  /*!< 0x00008000 */
#define SYSCFG_IOCFG_PA_EHS_Pos                   (24U)
#define SYSCFG_IOCFG_PA_EHS_Msk                   (0x1UL<<SYSCFG_IOCFG_PA_EHS_Pos)                  /*!< 0x01000000 */
#define SYSCFG_IOCFG_PA_EHS                       SYSCFG_IOCFG_PA_EHS_Msk                           
#define SYSCFG_IOCFG_PB_PU_EIIC_Pos               (25U)
#define SYSCFG_IOCFG_PB_PU_EIIC_Msk               (0x3UL<<SYSCFG_IOCFG_PB_PU_EIIC_Pos)              /*!< 0x06000000 */
#define SYSCFG_IOCFG_PB_PU_EIIC                   SYSCFG_IOCFG_PB_PU_EIIC_Msk
#define SYSCFG_IOCFG_PB_PU_EIIC_0                 (0x1UL<<SYSCFG_IOCFG_PB_PU_EIIC_Pos)              /*!< 0x02000000 */
#define SYSCFG_IOCFG_PB_PU_EIIC_1                 (0x2UL<<SYSCFG_IOCFG_PB_PU_EIIC_Pos)              /*!< 0x04000000 */
#define SYSCFG_IOCFG_I2C1_FILTEN_Pos              (30U)
#define SYSCFG_IOCFG_I2C1_FILTEN_Msk              (0x1UL<<SYSCFG_IOCFG_I2C1_FILTEN_Pos)             /*!< 0x04000000 */
#define SYSCFG_IOCFG_I2C1_FILTEN                  SYSCFG_IOCFG_I2C1_FILTEN_Msk

/********************************* Bit definition for PA_ANA2EN register ****************************************/
#define SYSCFG_PA_ANA2EN_PA9_ANA2EN_Pos           (9U)
#define SYSCFG_PA_ANA2EN_PA9_ANA2EN_Msk           (0x1UL<<SYSCFG_PA_ANA2EN_PA9_ANA2EN_Pos)          /*!< 0x00000200 */
#define SYSCFG_PA_ANA2EN_PA9_ANA2EN               SYSCFG_PA_ANA2EN_PA9_ANA2EN_Msk

#define SYSCFG_PA_ANA2EN_PA10_ANA2EN_Pos          (10U)
#define SYSCFG_PA_ANA2EN_PA10_ANA2EN_Msk          (0x1UL<<SYSCFG_PA_ANA2EN_PA10_ANA2EN_Pos)         /*!< 0x00000400 */
#define SYSCFG_PA_ANA2EN_PA10_ANA2EN              SYSCFG_PA_ANA2EN_PA10_ANA2EN_Msk


